#define HELP_MESSAGE "\
Генератор выборок зашумленных изображений noisgen\n\n\
--input - Обязательный параметр. Путь до директории со входной выборкой изображений в формате .png\n\
--output - Путь до директории сохранения итоговой выборки\n\
--precentage - Процент зашумления изображений (0.0-1.0)\n\
--iterations - Сколько раз сгенерируется зашумленная версия каждого изображения\n\
--seed - Seed генерации выборки (по-умолчанию случайный)\n\
--no-selection-json - Сгенерировать выборку на основе изображений в директории без использования selection.json\n\
--no-image-generation - Не генерировать .png изображения при работе генератора\
"
